app/controllers/short_urls_controller.rb

  def create
    short_url_params #Validate POST PARAMS

    #Validate unique URL
    if ShortUrl.find_by(full_url: params[:full_url])
      render json: "Error: URL already in database"
    end

    #Generate short code
    #short_code = ShortUrl.short_code(params[:full_url])
    #UpdateTitleJob.perform_later(@short_url)
    #Agregar título

    @short_url = ShortUrl.new(short_url_params)

    if @short_url.save
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`full_url` = 'http://youtube.com' LIMIT 1
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('http://youtube.com', '2022-04-28 18:21:12.079856', '2022-04-28 18:21:12.079856')

  def show
    @short_url = ShortUrl.find_by(title: params[:id])
    if @short_url #Check if found
      @short_url.increment!(:click_count) #Update count
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`title` = '98239123' LIMIT 1
UPDATE `short_urls` SET `short_urls`.`updated_at` = '2022-04-27 16:33:53.419241' WHERE `short_urls`.`id` = 1