app/controllers/short_urls_controller.rb

SELECT `short_urls`.* FROM `short_urls`
---
  def index
    @short_url = ShortUrl.all