app/controllers/short_urls_controller.rb

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`short_code` = 'abc' LIMIT 1
---
  def show
    @short_url = ShortUrl.find_by(short_code: params[:id])