app/jobs/update_title_job.rb

  def perform(short_url_id)
    @short_url = ShortUrl.find_by(id: short_url_id)
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 13 LIMIT 1